//====================================================
int n = 5;
int[] array = new int[n];
for (int i = 0; i < 5; i++)
{
    array[i] = Convert.ToInt32(Console.ReadLine());
}
Console.WriteLine("[" + string.Join(", ", array) + "]");
int sum = 0;
for (int i = 0; i < n; i++)
{
    sum += array[i];
}
Console.WriteLine(sum);
//Сложность данного нахождения суммы равна O(n)
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// Сложность алгоритма O(1)
// [4, 5, 3, 1, 2]
// O(n) при переборе массива
// [4, 5, 3, 1, 2] -> O(n * long n) - быстрая сортировка
// ((5+1)/2)*5 -> O(1) - при пешении за одно действие
// n < n * log(n) + 1
//====================================================
